benchmark_result/bench_result_hadware_evol/fio/xen_4_11_3/vm9/fio_result/round9/rand_write_throughput
rand_write_throughput: (g=0): rw=randwrite, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=64
...
fio-3.1
Starting 4 processes

rand_write_throughput: (groupid=0, jobs=4): err= 0: pid=18603: Fri Jun  7 05:34:49 2024
  write: IOPS=430, BW=435MiB/s (456MB/s)(25.6GiB/60353msec)
    slat (usec): min=425, max=5016.9k, avg=9179.66, stdev=141572.84
    clat (msec): min=7, max=5787, avg=580.10, stdev=1100.77
     lat (msec): min=109, max=5790, avg=589.24, stdev=1108.54
    clat percentiles (msec):
     |  1.00th=[  128],  5.00th=[  144], 10.00th=[  155], 20.00th=[  174],
     | 30.00th=[  188], 40.00th=[  201], 50.00th=[  213], 60.00th=[  226],
     | 70.00th=[  243], 80.00th=[  262], 90.00th=[ 3272], 95.00th=[ 3608],
     | 99.00th=[ 3775], 99.50th=[ 5738], 99.90th=[ 5738], 99.95th=[ 5805],
     | 99.99th=[ 5805]
   bw (  KiB/s): min= 4104, max=444416, per=54.82%, avg=243996.25, stdev=112536.89, samples=219
   iops        : min=    4, max=  434, avg=238.09, stdev=109.89, samples=219
  lat (msec)   : 10=0.01%, 20=0.01%, 250=75.57%, 500=14.62%, 750=0.05%
  lat (msec)   : 1000=0.04%, >=2000=10.67%
  cpu          : usr=2.22%, sys=6.98%, ctx=42201, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.2%, 32=0.5%, >=64=107.2%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=0,25979,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=435MiB/s (456MB/s), 435MiB/s-435MiB/s (456MB/s-456MB/s), io=25.6GiB (27.5GB), run=60353-60353msec

Disk stats (read/write):
  xvda: ios=0/224731, merge=0/21, ticks=0/3666640, in_queue=1539936, util=41.87%